export default {
  projections: {
    ЗаписьE: {
      кодЗаписи: {
        __caption__: 'Код записи'
      },
      время: {
        __caption__: 'Время'
      },
      дата: {
        __caption__: 'Дата'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      кабинет: {
        __caption__: 'Кабинет',
        номерКабинета: {
          __caption__: 'Номер кабинета'
        }
      },
      клиент: {
        __caption__: 'Клиент',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    },
    ЗаписьL: {
      кодЗаписи: {
        __caption__: 'Код записи'
      },
      время: {
        __caption__: 'Время'
      },
      дата: {
        __caption__: 'Дата'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сотрудник: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      кабинет: {
        __caption__: 'Номер кабинета',
        номерКабинета: {
          __caption__: 'Номер кабинета'
        }
      },
      клиент: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    кодЗаписи: {
      __caption__: 'Код записи'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    типОплаты: {
      __caption__: 'Тип оплаты'
    },
    кабинет: {
      __caption__: 'Кабинет'
    },
    клиент: {
      __caption__: 'Клиент'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    }
  }
};
